bookmarks.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-02-28 Sun 10:57 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Interesting</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" href="css/tufte.css" type="text/css" />
</head>
<body>
<div id="content">
<h1 class="title">Interesting</h1>
<p>
<a href="index.html">Back to home page</a>.
</p>

<p>
Assorted list of stuff on the web I found that looks interesting, so
that I don't forget about it. If I have had time to parse it, it also
has some minor commentary as to why I found it interesting.
</p>

<div id="outline-container-org20f2871" class="outline-2">
<h2 id="org20f2871">Emacs</h2>
<div class="outline-text-2" id="text-org20f2871">
<p>
Anything of interest on the subject of my favourite editor, Emacs.
</p>
</div>

<div id="outline-container-org0a20edc" class="outline-3">
<h3 id="org0a20edc">Configs</h3>
<div class="outline-text-3" id="text-org0a20edc">
<p>
User configurations with stuff I want to copy.
</p>

<ul class="org-ul">
<li><a href="https://github.com/redguardtoo/emacs.d">redguardtoo' emacs.d</a>: "A fast and robust Emacs setup"</li>
<li><a href="https://github.com/skeeto/.emacs.d">skeeto's .emacs.d</a>: "My Personal Emacs Configuration"</li>
<li><a href="https://github.com/caisah/emacs.dz">caisah's emacs.dz</a>: "A list of people with nice emacs config files"</li>
</ul>
</div>
</div>

<div id="outline-container-orgcbecb9b" class="outline-3">
<h3 id="orgcbecb9b">Authoring</h3>
<div class="outline-text-3" id="text-orgcbecb9b">
<ul class="org-ul">
<li><a href="https://github.com/emacs-love/weblorg">weblorg</a>: "A Static HTML Generator entirely written in
Emacs-Lisp". Not actually using it at present, but it does seem to
make the whole authoring process much easier.</li>
</ul>
</div>
</div>

<div id="outline-container-orga07bb0a" class="outline-3">
<h3 id="orga07bb0a">Email</h3>
<div class="outline-text-3" id="text-orga07bb0a">
<ul class="org-ul">
<li><a href="https://muto.ca/posts/actually-using-emacs-rmail.html">Actually Using Emacs Rmail</a>: blog post on how to setup rmail.</li>
</ul>
</div>
</div>

<div id="outline-container-org3768c79" class="outline-3">
<h3 id="org3768c79">Toolbar</h3>
<div class="outline-text-3" id="text-org3768c79">
<ul class="org-ul">
<li><a href="https://github.com/FStarLang/fstar-mode.el/blob/3afbf04e4eb21af950cfdb727d8b808164fd9415/fstar-mode.el#L5446">F* mode</a>: interesting use of SVG icons. See also</li>
</ul>
</div>
</div>

<div id="outline-container-org7fb9899" class="outline-3">
<h3 id="org7fb9899">People</h3>
<div class="outline-text-3" id="text-org7fb9899">
<p>
Blogs and other material from Emacs users.
</p>

<ul class="org-ul">
<li><a href="https://two-wrongs.com/">Two Wrongs</a>: blog created using Emacs tools with lots of posts on
emacs.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orge9dad45" class="outline-2">
<h2 id="orge9dad45">Audiobooks</h2>
<div class="outline-text-2" id="text-orge9dad45">
<ul class="org-ul">
<li><a href="https://www.bbc.co.uk/programmes/m000sh8r">Riot Girls</a>: Sci-fi story from BBC. Girls from the future which
appear to solve all our problems.</li>
</ul>
</div>
</div>

<div id="outline-container-orgcb5948f" class="outline-2">
<h2 id="orgcb5948f">Crypto</h2>
<div class="outline-text-2" id="text-orgcb5948f">
</div>
<div id="outline-container-org6172eea" class="outline-3">
<h3 id="org6172eea">ADA</h3>
<div class="outline-text-3" id="text-org6172eea">
<ul class="org-ul">
<li><a href="https://iohk.io/en/blog/posts/2021/02/25/babel-fees/">Babel fees - denominating transaction costs in native tokens</a></li>
<li><a href="https://www.linkedin.com/pulse/mary-hardfork-what-mean-cardano-frederik-gregaard/">The Mary hardfork - what will it mean for Cardano?</a></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org4c8d426" class="outline-2">
<h2 id="org4c8d426">C++</h2>
<div class="outline-text-2" id="text-org4c8d426">
</div>
<div id="outline-container-org73573f6" class="outline-3">
<h3 id="org73573f6">QuantLib</h3>
<div class="outline-text-3" id="text-org73573f6">
<ul class="org-ul">
<li><a href="http://cogitolearning.co.uk/2012/09/quantlib-automatic-conversion-with-the-exchange-rate-manager/">QuantLib: Automatic Conversion with the Exchange Rate Manager</a></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org847b7c6" class="outline-2">
<h2 id="org847b7c6">Articles I should read</h2>
<div class="outline-text-2" id="text-org847b7c6">
<ul class="org-ul">
<li><a href="https://blog.royalsloth.eu/posts/the-complexity-that-lives-in-the-gui/">The complexity that lives in the GUI</a></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2021-02-28 Sun 10:57</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
